In [94]:
import pandas as pd
import numpy as np

In [95]:
names = pd.read_csv('NationalNames.csv')
characters = pd.read_csv('datasets_1568_2804_movie_characters_metadata.tsv', 
                           sep='\t', error_bad_lines=False, header=None, warn_bad_lines=False)
lines = pd.read_csv('movie_lines.tsv', 
                           sep='\t', error_bad_lines=False, warn_bad_lines=False, header=None)

In [96]:
names['name'] = names['Name'].apply(lambda x: x.upper())

In [97]:
names = names.rename(columns={
    'Name': 'lower',
    'Gender': 'assumed_gender',
    'Count': 'name_count'
})
names = names[['Year', 'assumed_gender', 'name_count', 'name']]

In [98]:
names

         Year assumed_gender  name_count       name
0        1880              F        7065       MARY
1        1880              F        2604       ANNA
2        1880              F        2003       EMMA
3        1880              F        1939  ELIZABETH
4        1880              F        1746     MINNIE
...       ...            ...         ...        ...
1825428  2014              M           5     ZYKEEM
1825429  2014              M           5     ZYMEER
1825430  2014              M           5    ZYMIERE
1825431  2014              M           5      ZYRAN
1825432  2014              M           5      ZYRIN

[1825433 rows x 4 columns]

In [99]:
question = characters[characters[4] == '?']
question = question.rename(columns={
    0: 'id',
    1: 'name',
    2: 'movie_id',
    3: 'title',
    4: 'gender',
    5: 'credit_position'
})

In [100]:
#question['new_gender'] = question['name'].apply(lambda x: is 'DAKOTA')
question['named_dakota']= question['name'].apply(lambda x: 'True' if x == 'Dakota' else 'False')
question

,id,name,movie_id,title,gender,credit_position,named_dakota
1,u1,BRUCE,m0,10 things i hate about you,?,?,False
3,u3,CHASTITY,m0,10 things i hate about you,?,?,False
8,u8,MISS PERKY,m0,10 things i hate about you,?,?,False
10,u10,SHARON,m0,10 things i hate about you,?,?,False
12,u12,ALONSO,m1,1492: conquest of paradise,?,?,False
...,...,...,...,...,...,...,...
9029,u9030,DURNFORD,m616,zulu dawn,?,?,False
9030,u9031,MELVILL,m616,zulu dawn,?,?,False
9031,u9032,NORRIS-NEWMAN,m616,zulu dawn,?,?,False
9032,u9033,STUART SMITH,m616,zulu dawn,?,?,False
9033,u9034,VEREKER,m616,zulu dawn,?,?,False

In [101]:
name_assumptions = names.groupby(['name','assumed_gender']).agg({'name_count': ['max']})
name_assumptions = name_assumptions.reset_index()

In [102]:
cols = name_assumptions.columns.droplevel(1)

In [103]:
name_assumptions.columns = cols

In [104]:
name_assumptions

             name assumed_gender  name_count
0           AABAN              M          16
1           AABHA              F           9
2           AABID              M           5
3       AABRIELLA              F           5
4           AADAM              M          19
...           ...            ...         ...
104105  ZYTAVIOUS              M           7
104106     ZYVION              M           5
104107    ZYYANNA              F           6
104108      ZYYON              M           6
104109      ZZYZX              M           5

[104110 rows x 3 columns]

In [105]:
name_assumptions = name_assumptions.drop_duplicates(subset='name', keep="last")

In [106]:
df = question.merge(name_assumptions, on='name', how='left')

In [107]:
df = df.fillna('?')

In [108]:
question_df = df[df['assumed_gender'] == '?']
question_df

,id,name,movie_id,title,gender,credit_position,named_dakota,assumed_gender,name_count
2,u8,MISS PERKY,m0,10 things i hate about you,?,?,False,?,?
5,u13,AROJAZ,m1,1492: conquest of paradise,?,?,False,?,?
7,u15,BOBADILLA,m1,1492: conquest of paradise,?,?,False,?,?
10,u20,MENDEZ,m1,1492: conquest of paradise,?,?,False,?,?
11,u21,MOXICA,m1,1492: conquest of paradise,?,?,False,?,?
...,...,...,...,...,...,...,...,...,...
6003,u9030,DURNFORD,m616,zulu dawn,?,?,False,?,?
6004,u9031,MELVILL,m616,zulu dawn,?,?,False,?,?
6005,u9032,NORRIS-NEWMAN,m616,zulu dawn,?,?,False,?,?
6006,u9033,STUART SMITH,m616,zulu dawn,?,?,False,?,?
6007,u9034,VEREKER,m616,zulu dawn,?,?,False,?,?

In [109]:
def assign_gender(n):
    women = ['MRS', 'LADY', 'MS ', 'MISS', 'WOMAN', 'GIRL', 'CHICK', 'MADAM', 'MADAME', 'SENIORITA', 'SENORA',
            'MISTRESS', 'FEMALE', 'MOTHER', 'MOM', 'GRANDDAUGHTER', 'NIECE', 'AUNT', 'SISTER', 'DAUGHTER',
            'BROAD', 'DUCHESS', 'DAME', 'GENTLEWOMAN', 'QUEEN', 'CRONE', ' HAG', 'GAL', 'MAMA', 'MOMMA', 'BITCH',
            'MISSUS', 'EMPRESS', 'BARONESS', 'NOBLEWOMAN', 'GRANNY', 'NONNA', 'NUN', 'MRS.','MS.', 'FRAU','WIFE',
            'WIFEY', 'BRIDE']
    men = ['MR ', 'SENOR', 'MAN', 'GUY', 'DUDE', 'MISTER', 'BOY', 'MALE', 'BROTHER', 'HUSBAND', 'GENTLEMAN',
          'FATHER', 'DAD', 'GRANDSON', 'GRANDFATHER', 'NEPHEW', 'UNCLE', 'BARON', 'KNIGHT', 'EMPEROR', 'NOBLEMAN',
          'DADDY', 'PAPI', 'PAPA', 'GRANDPA', 'GRAMPS', 'CHAP', 'LAD', 'GEEZER', 'BLOKE', 'SIR', 'MR.', 'HUBBY','GROOM',
          'HERR']
    
    gender = '?'
    
    for x in women:
        if x in n:
            gender = 'F'
            
    for x in men:
        if x in n:
            gender = 'M'
            
    return gender

In [110]:
assign_gender('MISS PERKY')

'F'

In [111]:
question_df['assumed_gender'] = question_df['name'].apply(assign_gender)

C:\Users\positivelyalli\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [112]:
question_df.assumed_gender.value_counts()

?    2316
M     473
F     227
Name: assumed_gender, dtype: int64

In [113]:
question_df[question_df.assumed_gender == '?']

,id,name,movie_id,title,gender,credit_position,named_dakota,assumed_gender,name_count
5,u13,AROJAZ,m1,1492: conquest of paradise,?,?,False,?,?
7,u15,BOBADILLA,m1,1492: conquest of paradise,?,?,False,?,?
10,u20,MENDEZ,m1,1492: conquest of paradise,?,?,False,?,?
11,u21,MOXICA,m1,1492: conquest of paradise,?,?,False,?,?
12,u22,PINZON,m1,1492: conquest of paradise,?,?,False,?,?
...,...,...,...,...,...,...,...,...,...
6002,u9029,CREALOCK,m616,zulu dawn,?,?,False,?,?
6003,u9030,DURNFORD,m616,zulu dawn,?,?,False,?,?
6004,u9031,MELVILL,m616,zulu dawn,?,?,False,?,?
6006,u9033,STUART SMITH,m616,zulu dawn,?,?,False,?,?
6007,u9034,VEREKER,m616,zulu dawn,?,?,False,?,?

In [114]:
question_df[question_df.assumed_gender == '?']

,id,name,movie_id,title,gender,credit_position,named_dakota,assumed_gender,name_count
5,u13,AROJAZ,m1,1492: conquest of paradise,?,?,False,?,?
7,u15,BOBADILLA,m1,1492: conquest of paradise,?,?,False,?,?
10,u20,MENDEZ,m1,1492: conquest of paradise,?,?,False,?,?
11,u21,MOXICA,m1,1492: conquest of paradise,?,?,False,?,?
12,u22,PINZON,m1,1492: conquest of paradise,?,?,False,?,?
...,...,...,...,...,...,...,...,...,...
6002,u9029,CREALOCK,m616,zulu dawn,?,?,False,?,?
6003,u9030,DURNFORD,m616,zulu dawn,?,?,False,?,?
6004,u9031,MELVILL,m616,zulu dawn,?,?,False,?,?
6006,u9033,STUART SMITH,m616,zulu dawn,?,?,False,?,?
6007,u9034,VEREKER,m616,zulu dawn,?,?,False,?,?

In [89]:
pd.set_option('display.max_rows', 25)

In [115]:
name_assumptions.count()
name_assumptions[name_assumptions.name == 'ALEX']

      name assumed_gender  name_count
3233  ALEX              M        7636

In [116]:
female_names = name_assumptions[name_assumptions.assumed_gender == 'F']
female_names.head()

         name assumed_gender  name_count
1       AABHA              F           9
3   AABRIELLA              F           5
13    AADHIRA              F          13
14     AADHYA              F         249
22    AADISON              F           6

In [117]:
male_names = name_assumptions[name_assumptions.assumed_gender == 'M']
male_names.head()

      name assumed_gender  name_count
0    AABAN              M          16
2    AABID              M           5
4    AADAM              M          19
5    AADAN              M          23
6  AADARSH              M          18

In [120]:
question_df.assumed_gender

2       F
5       ?
7       ?
10      ?
11      ?
       ..
6003    ?
6004    ?
6005    M
6006    ?
6007    ?
Name: assumed_gender, Length: 3016, dtype: object

In [118]:
def assign_namesg(row):
    women = female_names.name.to_list()
    men = male_names.name.to_list()
        
    if row['assumed_gender' == '?']:
        gender = row['assumed_gender']

        
        for x in women:
            if x in n:
                gender = 'F'

        for x in men:
            if x in n:
                gender = 'M'
            
    return gender

In [93]:
question_df['assumed_gender'] = question_df['name'].apply(assign_namesg)
question_df.head()

C:\Users\positivelyalli\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

,id,name,movie_id,title,gender,credit_position,named_dakota,assumed_gender,name_count
2,u8,MISS PERKY,m0,10 things i hate about you,?,?,False,M,?
5,u13,AROJAZ,m1,1492: conquest of paradise,?,?,False,M,?
7,u15,BOBADILLA,m1,1492: conquest of paradise,?,?,False,M,?
10,u20,MENDEZ,m1,1492: conquest of paradise,?,?,False,M,?
11,u21,MOXICA,m1,1492: conquest of paradise,?,?,False,M,?